{
	"nodes":[
		{"op":"null","name":"myIn","attrs":{},"inputs":[]},
		{"op":"Dropout","name":"In$0","attrs":{"p":"0.1e-1"},"inputs":[[0,0,0]]},
		{"op":"null","name":"W.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"W.Biases","attrs":{},"inputs":[]},
		{"op":"FullyConnected","name":"W","attrs":{"num_hidden":"1","no_bias":"False"},"inputs":[[1,0,0],[2,0,0],[3,0,0]]},
		{"op":"relu","name":"Out$0","attrs":{},"inputs":[[4,0,0]]},
		{"op":"identity","name":"myOut","attrs":{},"inputs":[[5,0,0]]}
	],
	"arg_nodes":[0,2,3],
	"heads":[
		[6,0,0]
	],
	"attrs":{
		"mxnet_version":["int",10001]
	}
}