{
	"nodes":[
		{"op":"null","name":".Inputs.myIn1","attrs":{},"inputs":[]},
		{"op":"null","name":".Inputs.myIn2","attrs":{},"inputs":[]},
		{"op":"Dropout","name":".Nodes.In1$0","attrs":{"p":"0.1e-1"},"inputs":[[0,0,0]]},
		{"op":"null","name":".Nodes.W1.Arrays.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":".Nodes.W1.Arrays.Biases","attrs":{},"inputs":[]},
		{"op":"FullyConnected","name":".Nodes.W1","attrs":{"num_hidden":"1","no_bias":"False"},"inputs":[[2,0,0],[3,0,0],[4,0,0]]},
		{"op":"relu","name":".Nodes.Out1$0","attrs":{},"inputs":[[5,0,0]]},
		{"op":"Dropout","name":".Nodes.In2$0","attrs":{"p":"0.1e-1"},"inputs":[[1,0,0]]},
		{"op":"null","name":".Nodes.W2.Arrays.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":".Nodes.W2.Arrays.Biases","attrs":{},"inputs":[]},
		{"op":"FullyConnected","name":".Nodes.W2","attrs":{"num_hidden":"1","no_bias":"False"},"inputs":[[7,0,0],[8,0,0],[9,0,0]]},
		{"op":"relu","name":".Nodes.Out2$0","attrs":{},"inputs":[[10,0,0]]},
		{"op":"_Plus","name":".Nodes.Out$0","attrs":{},"inputs":[[6,0,0],[11,0,0]]},
		{"op":"null","name":".Nodes.OutW.Arrays.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":".Nodes.OutW.Arrays.Biases","attrs":{},"inputs":[]},
		{"op":"FullyConnected","name":".Nodes.OutW","attrs":{"num_hidden":"1","no_bias":"False"},"inputs":[[12,0,0],[13,0,0],[14,0,0]]},
		{"op":"identity","name":".Outputs.myOut1","attrs":{},"inputs":[[12,0,0]]},
		{"op":"identity","name":".Outputs.myOut2","attrs":{},"inputs":[[15,0,0]]}
	],
	"arg_nodes":[0,1,3,4,8,9,13,14],
	"heads":[
		[16,0,0],
		[17,0,0]
	],
	"attrs":{
		"mxnet_version":["int",10001]
	}
}