{
	"nodes":[
		{"op":"null","name":"myIn1","attrs":{},"inputs":[]},
		{"op":"null","name":"myIn2","attrs":{},"inputs":[]},
		{"op":"Dropout","name":"In1$0","attrs":{"p":"0.1e-1"},"inputs":[[0,0,0]]},
		{"op":"null","name":"W1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"W1.Biases","attrs":{},"inputs":[]},
		{"op":"FullyConnected","name":"W1","attrs":{"num_hidden":"1","no_bias":"False"},"inputs":[[2,0,0],[3,0,0],[4,0,0]]},
		{"op":"relu","name":"Out1$0","attrs":{},"inputs":[[5,0,0]]},
		{"op":"Dropout","name":"In2$0","attrs":{"p":"0.1e-1"},"inputs":[[1,0,0]]},
		{"op":"null","name":"W2.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"W2.Biases","attrs":{},"inputs":[]},
		{"op":"FullyConnected","name":"W2","attrs":{"num_hidden":"1","no_bias":"False"},"inputs":[[7,0,0],[8,0,0],[9,0,0]]},
		{"op":"relu","name":"Out2$0","attrs":{},"inputs":[[10,0,0]]},
		{"op":"_Plus","name":"Out$0","attrs":{},"inputs":[[6,0,0],[11,0,0]]},
		{"op":"null","name":"OutW.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"OutW.Biases","attrs":{},"inputs":[]},
		{"op":"FullyConnected","name":"OutW","attrs":{"num_hidden":"1","no_bias":"False"},"inputs":[[12,0,0],[13,0,0],[14,0,0]]},
		{"op":"identity","name":"myOut1","attrs":{},"inputs":[[12,0,0]]},
		{"op":"identity","name":"myOut2","attrs":{},"inputs":[[15,0,0]]}
	],
	"arg_nodes":[0,1,3,4,8,9,13,14],
	"heads":[
		[16,0,0],
		[17,0,0]
	],
	"attrs":{
		"mxnet_version":["int",10001]
	}
}