{
	"nodes":[
		{"op":"null","name":"Input","attr":{},"inputs":[]},
		{"op":"null","name":"1.Weights","attr":{},"inputs":[]},
		{"op":"null","name":"1.Biases","attr":{},"inputs":[]},
		{"op":"FullyConnected","name":"1","attr":{"num_hidden":"2","no_bias":"False"},"inputs":[[0,0,0],[1,0,0],[2,0,0]]}
	],
	"arg_nodes":[0,1,2],
	"heads":[
		[3,0,0]
	],
	"attrs":{
		"mxnet_version":["int",905]
	}
}