{
  "nodes": [
    {
      "op": "null", 
      "name": "/in1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(0, 2)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(2, 50)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot1", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(50,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(50, 20)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot3", 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(20,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "out/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(20, 2)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot5", 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "out/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(2,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1", 
      "inputs": [[14, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 3, 6, 8, 11, 13], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16
  ], 
  "heads": [[15, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}